In [1]:
%matplotlib
import pandas as pd

Using matplotlib backend: agg

In [13]:
url = 'https://raw.githubusercontent.com/LetsUpgrade/AI-ML-July-2020/master/Day-16%2C17/Assingment/Dataset%20for%20Pandas%20Assinment/titles.csv'
titles = pd.read_csv(url)

In [14]:
titles.head()

                  title  year
0    Tasveer Mere Sanam  1996
1              Only You  1994
2  El pueblo del terror  1970
3               Machine  2007
4                  MARy  2008

How many movies are lised in the titles Dataframe?

In [9]:
print("No.of Movies lised in the Titles DF ",titles.shape[0])

No.of Movies lised in the Titles DF  244914

What are the earliest two films listed in the titles dataframe?

In [19]:
titles.sort_values('year').head(2)

                     title  year
193222          Miss Jerry  1894
51388   The Startled Lover  1898

How many movies have the title "Hamlet"?

In [28]:
Hamlet_movies = titles[titles['title'] == 'Hamlet']
print(Hamlet_movies)

         title  year
6422    Hamlet  2017
10637   Hamlet  1921
39916   Hamlet  1913
52521   Hamlet  1910
62000   Hamlet  2000
67406   Hamlet  1969
82130   Hamlet  1987
88065   Hamlet  2016
101728  Hamlet  1948
122827  Hamlet  1973
133921  Hamlet  1976
154029  Hamlet  2015
161324  Hamlet  1964
172640  Hamlet  1954
173033  Hamlet  2011
178222  Hamlet  1996
189093  Hamlet  2009
192142  Hamlet  1990
198234  Hamlet  1911
202025  Hamlet  2014

In [29]:
print("No.of movies with the title 'Hamlet' ",Hamlet_movies.count())

No.of movies with the title 'Hamlet'  title    20
year     20
dtype: int64

How many movies are titled "North by Northwest"?

In [30]:
North_by_Northwest_movies = titles[titles['title'] == 'North by Northwest']
print(North_by_Northwest_movies)

                    title  year
74398  North by Northwest  1959

In [31]:
print("No.of movies with the title 'North by Northwest' ",North_by_Northwest_movies.count())

No.of movies with the title 'North by Northwest'  title    1
year     1
dtype: int64

When was the first movie titled "Hamlet" made?

In [34]:
Hamlet_movies.sort_values('year').head(1)

        title  year
52521  Hamlet  1910

List all of the "Treasure Island" movies from earliest to most recent.

In [35]:
titles[titles['title'] == 'Treasure Island'].sort_values('year')

                  title  year
55686   Treasure Island  1918
196514  Treasure Island  1920
141822  Treasure Island  1934
77354   Treasure Island  1950
65051   Treasure Island  1972
37238   Treasure Island  1973
173051  Treasure Island  1985
27076   Treasure Island  1999

How many movies were made in the year 1950?

In [45]:
print('No.of movies were made in year 1950 ',titles['year'][titles['year'] == 1950].count())

No.of movies were made in year 1950  1113

How many movies were made in the year 1960?

In [47]:
print('No.of movies were made in year 1960, ',titles['year'][titles['year'] == 1960].count())

No.of movies were made in year 1960,  1549

How many movies were made from 1950 through 1959?

In [49]:
print('No.of movies were made in between 1950 and 1959, ',titles['year'].between(1950, 1959).count())

No.of movies were made in between 1950 and 1959,  244914

In what years has a movie titled "Batman" been released?

In [54]:
titles[titles['title'] == 'Batman'].sort_values('year')

         title  year
39349   Batman  1943
240896  Batman  1989

In [58]:
titles['title'][titles['title'] == 'Inception']

183910    Inception
Name: title, dtype: object

# Loading CAST data set

In [57]:
casts =  pd.read_csv('cast.csv')
casts.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4  31.0
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

How many roles were there in the movie "Inception"?

In [64]:
casts[casts['title'] == 'Inception'].character.count()

77

How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [67]:
casts[casts['title'] == 'Inception'].n.isnull().count()

77

But how many roles in the movie "Inception" did receive an "n" value

In [68]:
casts[casts['title'] == 'Inception'].n.count()

50

Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [71]:
casts[casts['title'] == 'North by Northwest'].sort_values('n')

                      title  year  ...                   character    n
871426   North by Northwest  1959  ...          Roger O. Thornhill  1.0
3518333  North by Northwest  1959  ...                 Eve Kendall  2.0
1457165  North by Northwest  1959  ...             Phillip Vandamm  3.0
3157232  North by Northwest  1959  ...             Clara Thornhill  4.0
356707   North by Northwest  1959  ...               The Professor  5.0
...                     ...   ...  ...                         ...  ...
3109216  North by Northwest  1959  ...                 Mrs. Finlay  NaN
3158656  North by Northwest  1959  ...  Maggie - Roger's Secretary  NaN
3246557  North by Northwest  1959  ...          Anna - Housekeeper  NaN
3272585  North by Northwest  1959  ...                   Attendant  NaN
3441077  North by Northwest  1959  ...                Elsie - Maid  NaN

[112 rows x 6 columns]

Display the entire cast, in "n"-order, of the 1972 film "Sleuth"

In [73]:
casts[(casts['title'] == 'Sleuth') & (casts['year'] == 1972)].sort_values('n')

          title  year  ...                   character    n
1705394  Sleuth  1972  ...                 Andrew Wyke  1.0
326773   Sleuth  1972  ...                 Milo Tindle  2.0
373876   Sleuth  1972  ...           Inspector Doppler  3.0
1465483  Sleuth  1972  ...  Detective Sergeant Tarrant  4.0
2724553  Sleuth  1972  ...             Marguerite Wyke  5.0
1448690  Sleuth  1972  ...      Police Constable Higgs  6.0

[6 rows x 6 columns]

Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

In [74]:
casts[(casts['title'] == 'Sleuth') & (casts['year'] == 2007)].sort_values('n')

          title  year                 name     type          character    n
326774   Sleuth  2007        Michael Caine    actor             Andrew  1.0
1293634  Sleuth  2007             Jude Law    actor               Milo  2.0
1805907  Sleuth  2007        Harold Pinter    actor        Man on T.V.  3.0
260242   Sleuth  2007      Kenneth Branagh    actor  Other Man on T.V.  NaN
373877   Sleuth  2007  Alec (II) Cawthorne    actor  Inspector Doppler  NaN
2724552  Sleuth  2007    Eve (II) Channing  actress    Marguerite Wyke  NaN
3370424  Sleuth  2007    Carmel O'Sullivan  actress             Maggie  NaN


How many roles were credited in the silent 1921 version of Hamlet?

In [77]:
casts['title'][(casts['title'] == 'Hamlet') & (casts['year'] == 1921)].count()

9

How many roles were credited in Branagh’s 1996 Hamlet?

In [78]:
casts['title'][(casts['title'] == 'Hamlet') & (casts['year'] == 1996)].count()

52

How many "Hamlet" roles have been listed in all film credits through history?

In [83]:
casts['title'][casts['title'] == 'Hamlet'].count()

329

How many people have played an "Ophelia"?

In [85]:
casts['title'][casts['character'] == 'Ophelia'].count()

97

How many people have played a role called "The Dude"?

In [86]:
casts['title'][casts['character'] == 'The Dude'].count()

19

How many people have played a role called "The Stranger"?

In [87]:
casts['title'][casts['character'] == 'The Stranger'].count()

210

How many roles has Sidney Poitier played throughout his career?

In [89]:
casts['title'][casts['name'] == 'Sidney Poitier'].count()

43

How many roles has Judi Dench played?

In [90]:
casts['title'][casts['name'] == 'Judi Dench'].count()

55

List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

In [121]:
casts[(casts['name'] == 'Cary Grant') & (casts['n'] == 2) & (casts['year'] >= 1940) & (casts['year'] < 1950)].sort_values('year')

                   title  year        name   type    character    n
871423  My Favorite Wife  1940  Cary Grant  actor   Nick Arden  2.0
871433    Penny Serenade  1941  Cary Grant  actor  Roger Adams  2.0

List the leading roles that Cary Grant played in the 1940s in order by year.

In [120]:
casts[(casts['name'] == 'Cary Grant') & (casts['year'] >= 1940) & (casts['year'] < 1950)].sort_values('year')

                                       title  ...    n
871450                The Philadelphia Story  ...  1.0
871448               The Howards of Virginia  ...  1.0
871407                       His Girl Friday  ...  1.0
871423                      My Favorite Wife  ...  2.0
871438                             Suspicion  ...  1.0
871433                        Penny Serenade  ...  2.0
871452                  The Talk of the Town  ...  1.0
871429                 Once Upon a Honeymoon  ...  1.0
871398                     Destination Tokyo  ...  1.0
871422                             Mr. Lucky  ...  1.0
871390                  Arsenic and Old Lace  ...  1.0
871430                      Once Upon a Time  ...  1.0
871425             None But the Lonely Heart  ...  1.0
871405               George White's Scandals  ...  NaN
871424                         Night and Day  ...  1.0
871427                             Notorious  ...  1.0
871466                  Without Reservations  ...  NaN
871444      The Bachelor and the Bobby-Soxer  ...  1.0
871445                     The Bishop's Wife  ...  1.0
871421  Mr. Blandings Builds His Dream House  ...  1.0
871402          Every Girl Should Be Married  ...  1.0
871411                I Was a Male War Bride  ...  1.0

[22 rows x 6 columns]

How many roles were available for actors in the 1950s?

In [119]:
casts['type'][(casts['year'] >= 1950) & (casts['year'] < 1960) & (casts['type'] == 'actor')].count()

157738

How many roles were available for actresses in the 1950s?

In [118]:
casts['type'][(casts['year'] >= 1950) &(casts['year'] <1960) & (casts['type'] == 'actress')].count()

47241

How many leading roles (n=1) were available from the beginning of film history through 1980?

In [115]:
casts['n'][(casts['n'] == 1) & (casts['year'] <= 1980)].count()

60884

How many non-leading roles were available through from the beginning of film history through 1980?

In [117]:
(casts[casts.year <= 1980].character.count()) - (casts[(casts.n == 1)&(casts.year <= 1980)].character.count())

1059654

How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?

In [116]:
casts['n'][casts['year'] == 1980].isnull().sum()

4195